// Домашнее задание 
// Задача 2.
// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньше


/*

Console.Write("Input the first number:  ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second number:  ");
int b = Convert.ToInt32(Console.ReadLine());

if(a>b)
{
    Console.Write(a + " is the biggest number and " + b + " is the smallest one");
}
else
{
    Console.Write(b + " is the biggest number and " + a + " is the smallest one");
}

*/


// Задача 4.
// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
