// Задача 10.
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/*

int NewNumber(int number)
{
    number = number / 10;
    number = number % 10;
    return number;
}

Console.Write("Input a three digit number: ");
int a = Convert.ToInt32(Console.ReadLine());

int result = NewNumber(a);

Console.WriteLine("Your updated number of " + a + " is " + result);

*/
